{
    "Tutorial: Act I": ["NARRATOR: A man lies on the grassy floor of Anthill Forest. His eyes return a blank stare to the clear sky.",
"???: Hey", 
"???: Hey you, on the ground.", 
"YOU: Me? Who are you? Where are you?",
"OTHER YOU: Let's just say I'm the 'Other You'. I'm a part of you essentially, so no one else can hear me. I'll be acting like your guide throughout this adventure.",
"YOU: Okay.. wait. Who am I?",
"OTHER YOU: Let's just call you {player name} for now. Come on, get up. We have a journey to start on.",
"TUTORIAL: Within movement, there are three types of movement. Map, sublocation, and location movement.",
"TUTORIAL: This is the map. To move throughout the grid, use the WASD keys to input which direction you want to move. All youwould need to do is type the key.",
"TUTORIAL: Now that you know how to move, it is important to know that this is the map of one sublocation. The size of the map of each sublocation may vary. Some may be 5x5 or 2x3. Either way, the WASD keys will allow you to move throughout these maps.",
"TUTORIAL: To move to different sublocations, you'll need to use the 'switch sl.name' command where you input the name of the sublocation as the 'name'. The 'sl' before the period stands for 'sublocation'.",
"TUTORIAL: Before we do this, you'll need to know the names of these sublocations. To find this, you can use the command 'info sl' and it will return the sublocations within your location.",
"TUTORIAL: If we use it, we can see there are 8 types of different sublocations to choose one. Let's go to the Myrminki Village for now.",
"TUTORIAL: You are now at Myrminki Village. Any time you switch sublocations or locations, it will tell you where you are. Last thing to know, each location has 8 types of sublocations and each sublocation can be categorized. Each location has:",
"1 Center SL: Starting Point, can be used in story or quests. ",
"3 Quest SLs: NPCs will be here to give quests out. They will only give these quests after the story portion within the location is completed.",
"3 Event SLs: These are places where you can interact with things. These include shops, healing areas, and another event like storage or puzzles.",
"Wild SLs: This area fills in the rest of the map. This is where you find enemies or loot.",
"TUTORIAL: To switch locations, you can use the 'switch l.name' command, but different locations require a certain progress in the story. At the moment, Anthill Forest is the only location available.", 
"TUTORIAL: That's it for now! If you need any of this information at any time, use the 'help' command and choose the movement category to revisit different commands.",
"???: ...",
"???: AHH!",
"???: Please don't hurt me! I'm just a humble scientist, the head of the science department to be exact, and having 43 metals.. and the owner of Anticore Lab.. an-",
"OTHER YOU: Yeah, he's humble, that's for sure.",
"NARRATOR: You sheath your sword and lower your guard. You raise your arms as a sign of peace.",
"???: Oh, you're not here to kill me. Sorry, I thought you were one of these castle guards. I'm Antinine, nice to meet you..",
"NARRATOR: You point to the nametag on your chest.",
"ANTININE: ..{player name}. A silent one, eh? Well, according to law, I'm supposed to take you to the Myrminki Assembly, so… could you possibly.. like, come with me?",
"NARRATOR: You nod.",
"ANTININE: Oh. I didn't think you would actually agree to that. Well, come with me then. I'll try to give you my best assistance in this matter. It's been a while since there has been an outsider.. and I'm running low on inspiration for my next experiments. Hmm.. maybe I could use your blood for something..",
"NARRATOR: You give him an unamused look but follow him nonetheless.",
"GAME: It is recommended to explore the 'help' command and all its categories at this time to understand how to play the game properly."
],
    "Tutorial: Act II": ["MYRMINKIAN TRIUMVIRATE: Speak before your leaders. Who have you brought upon us?",
"ANTININE: Your Graces, I have brought a traveler from afar, a wanderer lost both ways, an outsider to socie-",
"MYRMINKIAN TRIUMVIRATE: That's enough Antinine. We understand. You may take your leave now.",
"ANTININE: Well, you see. This traveler is actually very friendly. Yeah, um.. he spared my life an-",
"MYRMINKIAN TRIUMVIRATE: Antinine. Why were you outside the town walls?",
"ANTININE: Uh.. yeah, I'll be taking my leave.",
"NARRATOR: Antinine leaves.",
"MYRMINKIAN TRIUMVIRATE: Doesn't he just ramble on and on?",
"NARRATOR: You shrug.",
"MYRMINKIAN TRIUMVIRATE: Well, since he seems to trust you and you haven't caused any trouble for us, it's looking promising for you. However, we do have a required duel to get a sense of your strength. Prepare for battle."
],
    "Tutorial: Act II 2": ["MYRMINKIAN TRIUMVIRATE: You're strong. After assessing your performance, we have made a verdict. We'll allow you to roam around for now. But be warned, if you cause any sort of commotion, you must aid in protecting the village or you will be punished accordingly. Do you understand?",
"NARRATOR: You nod.",
"MYRMINKIAN TRIUMVIRATE: Forgive us if we are too weary. Legend has told of a man setting flames to all which he walks. You may take your leave now.",
"NARRATOR: You leave."
],
    "Tutorial: Act III": ["NARRATOR: You approach the place with caution. The wind gushes against you and the wooden planks tremble beneath you. You eventually make it to the door and knock. A small squirrel-like creature opens the door. ",
"???: Hey. You wanted to check this place out?",
"NARRATOR: You wave and give a slight nod.",
"???: Alright, come in. I'm Ratashkin. Call me if you need anything.",
"NARRATOR: You decide to look around the room for a while.",
"TUTORIAL: When you receive an objective to look around and explore, the squares marked with an 'X' on the map indicate objects or interactables. To interact with them, you just move to the square where they are located.",
"TUTORIAL: Sometimes if there are multiple interactables at once, the ones you have already interacted with will be shown as an 'O' instead of an 'X'."
],
    "Act III Item 1": ["NARRATOR: You find an old telescope. You look through it, but only see an open plain."
],
    "Act III Item 2": ["NARRATOR: You pick up old newspaper clippings. You stare intently at their words. They seem to detail the history of this town. The founding of this village began when a group of these ant-like creatures combined forces. They built the place from the ground up. An outer wall was created to keep out enemies and protect those within. The next section describes the people of this town. It is speculated that the king from the castle nearby has been performing cruel experiments on human test subjects. His goal was to create a perfect being. He began to experiment with all kinds of species, mixing them with human intelligence. The people in this town and the enemies outside are all results of these experiments, later exiled when no longer needed. The text becomes too faded after that."
],
    "Tutorial: Act III 2": ["RATASHKIN: Hey, do you find those stories interesting?",
"NARRATOR: You nod.",
"RATASHKIN: Okay, then I have a proposal. Legend has it that there is a special experiment in an abandoned bunker not too far from here. I've always wanted to go, but it could be dangerous for one person alone. What do you say, there could be treasure?",
"YOU: …",
"NARRATOR: You look at him with suspicion.",
"RATASHKIN: Listen, it's totally legal and allowed. And if it goes well, I'll definitely compensate you.",
"NARRATOR: You let out a sigh and nod.",
"RATASHKIN: Alright! I'll meet you there. Let me get ready first."
],
    "Tutorial: Act IV": ["NARRATOR: You arrive at the place with no one in sight. The place is crowded and overgrown. The tiniest bit of sunlight peeks through the plants, just enough to reveal the entrance. After a while, Ratashkin arrives.",
"NARRATOR: You look at him with an annoyed expression.",
"RATASHKIN: Look, sorry that I took so long. It was hard getting over here.",
"NARRATOR: Not wanting to deal with his nonsense, you decide to take the lead.",
"NARRATOR: You encounter a room with four totems in each corner. A note on the floor reads...",
"NARRATOR: God once said 'Let there be light.' and there was light. You must do the same, but an order must be fulfilled. Light by strokes of your hand, not by a childhood hymn."
],
    "Act IV Totem Bottom Left": ["NARRATOR: You find a totem with an 'O' engraving. You light it."
],
    "Act IV Totem Top Right": ["NARRATOR: You find a totem with a 'N' engraving. You light it."
],
    "Act IV Totem Top Left": ["NARRATOR: You find a totem with a 'M' engraving. You light it."
],
    "Act IV Totem Bottom Right": ["NARRATOR: You find a totem with a 'L' engraving. You light it."
],
    "Lit Totem": ["This pillar has already been lit."
],
    "Tutorial: Act IV 2": ["NARRATOR: A door opens as you light the final totem. It reveals a staircase leading down into darkness. A low growl can be heard.",
"RATASHKIN: Treasure? Welp, thanks for the help, but I'll be going!",
"NARRATOR: You see Ratashkin dash into the shadows without you. As you approach the staircase entrance, he rushes past you in a blur, but you manage to catch his panicked expression. You see an abomination of insects charging up the stairs, squeezing through and cracking the walls. You turn around and make a run for it, but the creature is faster."
],
    "Tutorial: Act IV 3": ["NARRATOR: You just manage to escape."
],
    "Tutorial: Act V": ["NARRATOR: As you charge into the center of the village, you see Ratashkin caught by the tail by an officer and explaining what happened. You see the Myrminkian Triumvirate in front of you with panicked and furious expressions.",
"MYRMINKIAN TRIUMVIRATE: Guards! Soldiers! Squad B! Formation A! Fire the weapons!"
],
    "Tutorial: Act V 2": ["MYRMINKIAN TRIUMVIRATE: Thank you for the assistance. We could've never done it without you.",
"MYRMINKIAN TRIUMVIRATE: However, you did break our agreement. You did cause quite the commotion. But, we recognize that you did aid in saving the town and fixing your mistakes. As a collective, we have decided that you may not stay here, but you can come in from time to time. You may not be a permanent resident, rather a visiting traveler. This is all we have to say. Let us think now in peace. That creature could not have hidden its existence for that long. And its origin..",
"NARRATOR: You look back at the town and wonder what other secrets are hidden. You decide to head out onward towards the castle, hoping to find out the source of these experiments, your identity, and more. You have much to learn."
],

    "Frank": ["FRANK: Welcome to the town's blacksmith, what can I do for you today?"],
    "Frank 1": ["FRANK: Need a big ol' hammer to the head? Ha ha, just joking."],
    "Frank 2": ["FRANK: Your blade looks dull, you could use a new one perhaps."],
    "Frank 3": ["FRANK: If you're interested, we're hiring. We also offer classes in this sort of field. Not interested? Okay, just tell me what you need."],

    "Anticore": ["ANTICORE: Hey, welcome! I've got a whole selection just for you."],
    "Anticore 1": ["ANTICORE: Here, try this one. I hear it speeds up every process in your body. No? Alright, it was worth a try."],
    "Anticore 2": ["ANTICORE: Want the dark purple one? If I'm not mistaken, it's suppose to cause someone to sponatneously implode. Or it's the other one that just gives you a slight strength boost."],
    "Anticore 3": ["ANTICORE: You should definitely visit more often. Maybe I'll be able to shoot you with my inverse gun and see what happens."],

    "Banker": ["JERRY: Hey! Here at 'Big Bankers', there is a 1000% guarentee of the safety of your goods."],
    "Banker 1": ["JERRY: Imagine if I just withdrew all your riches. That would be funny.. woah, woah! I won't actually do it!"],
    "Banker 2": ["JERRY: Well, it looks like you have nothing in your bank acount... nah I'm joking. You should've seen your face!"],
    "Banker 3": ["JERRY: Would you like to donate everything to the starving children of A-? You wouldn't!? Wow, I wasn't even being serious."],

    "The Hero Once Praised": ["MYRMINKIAN TRIUMVIRATE: As a hero and outcast, you may approach us. What is it you want to ask?",
"NARRATOR: You stare deeply into their eyes as yours fills with the look of sorrow and destruction. A sculpture of flames erupts in your mind, and you concentrate deeply at conveying this message.",
"MYRMINKIAN TRIUMVIRATE: Is it the legend we spoke of the first time we met? ",
"NARRATOR: You nod.",
"MYRMINKIAN TRIUMVIRATE: Well then, answer me this riddle and all shall be revealed.",
"NARRATOR: The Triumvirate hands you a note. It reads:",
"'The lantern's bright comes dashingly forth,",
"behind the scenes remains unseen,",
"the gift in the center, the beautiful source,",
"a well created oil-powered machine.",
"What am I?'",
"If you need a hint, just ask for one by typing 'Hint'."
],
    "Hint": ["HINT: Hot and generally orange/red. We combat it with water."],
    "The Hero Once Praised 2": ["MYRMINKIAN TRIUMVIRATE: Very well. I shall tell you the story of a lost hero, once a savior, but fallen after that. He was a young boy named Adam living a normal life in a normal village. However, soon, invaders attacked and their village was placed under the rule of King Serpent, the very same one from today. As he watched the people get taken away to never return, his fury only grew stronger. He decided that he could no longer sit back and watch. He had to act.",
"MYRMINKIAN TRIUMVIRATE: And so he did. He gathered an army of those who remained and distributed weapons he had been working on in secret. Then, in the cloak of midnight, they struck the castle hard. For seven days and seven nights they waged war, and the last day was the only time King Serpent ordered a retreat. He managed to escape, but all his men were killed. However, he smiled when he saw the hero and vanished soon after. ",
"MYRMINKIAN TRIUMVIRATE: The next day, the hero was not the same. He was less concerned with the public or the village. He grew quiet, distant, and was never seen for long periods of time. When he was seen, he was never as warm or charming as he once was. He seemed to become more and more bitter and selfish until one day, he too vanished completely. They say that this 'Wandering Flames' is a creation of his. An experiment per se. An experiment no better than the King's. That is the story of the hero and the 'Flames'."
]

}